Simsoniteee/TestRepo/F2837x_i2c_tmp006/device/driverlib/inc/hw_memcfg.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXTEST register
//
//*****************************************************************************
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_S  0U
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_M  0x3U         // CPU to CPU Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_S  2U
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_M  0xCU         // CPU to CLA1 MSG RAM Mode
                                               // Select
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_S  4U
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_M  0x30U        // CLA1 to CPU MSG RAM Mode
                                               // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXINIT register
//
//*****************************************************************************
#define MEMCFG_MSGXINIT_INIT_CPUTOCPU  0x1U         // Initialization control for
                                               // CPU to CPU MSG RAM
#define MEMCFG_MSGXINIT_INIT_CPUTOCLA1  0x2U         // Initialization control for
                                               // CPUTOCLA1 MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TOCPU  0x4U         // Initialization control for
                                               // CLA1TOCPU MSG RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the MSGXINITDONE register
//
//*****************************************************************************
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCPU  0x1U         // Initialization status for CPU
                                               // to CPU MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCLA1  0x2U         // Initialization status for CPU
                                               // to CLA1 MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TOCPU  0x4U         // Initialization status for
                                               // CLA1 to CPU MSG RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1LOCK register
//
//*****************************************************************************
#define MEMCFG_EMIF1LOCK_LOCK_EMIF1  0x1U         // EMIF1 access protection and
                                               // master select fields lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1COMMIT register
//
//*****************************************************************************
#define MEMCFG_EMIF1COMMIT_COMMIT_EMIF1  0x1U         // EMIF1 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1MSEL register
//
//*****************************************************************************
#define MEMCFG_EMIF1MSEL_MSEL_EMIF1_S  0U
#define MEMCFG_EMIF1MSEL_MSEL_EMIF1_M  0x3U         // Master Select for EMIF1.
#define MEMCFG_EMIF1MSEL_KEY_S    4U
#define MEMCFG_EMIF1MSEL_KEY_M    0xFFFFFFF0U  // KEY to enable the write into
                                               // MSEL_EMIF1 bits

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF1ACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_EMIF1ACCPROT0_FETCHPROT_EMIF1  0x1U         // Fetch Protection For EMIF1
#define MEMCFG_EMIF1ACCPROT0_CPUWRPROT_EMIF1  0x2U         // CPU WR Protection For EMIF1
#define MEMCFG_EMIF1ACCPROT0_DMAWRPROT_EMIF1  0x4U         // DMA WR Protection For EMIF1

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2LOCK register
//
//*****************************************************************************
#define MEMCFG_EMIF2LOCK_LOCK_EMIF2  0x1U         // EMIF2 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2COMMIT register
//
//*****************************************************************************
#define MEMCFG_EMIF2COMMIT_COMMIT_EMIF2  0x1U         // EMIF2 access protection and
                                               // master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the EMIF2ACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_EMIF2ACCPROT0_FETCHPROT_EMIF1  0x1U         // Fetch Protection For EMIF2
#define MEMCFG_EMIF2ACCPROT0_CPUWRPROT_EMIF1  0x2U         // CPU WR Protection For EMIF2

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVFLG register
//
//*****************************************************************************
#define MEMCFG_NMAVFLG_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag
#define MEMCFG_NMAVFLG_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVSET register
//
//*****************************************************************************
#define MEMCFG_NMAVSET_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag Set
#define MEMCFG_NMAVSET_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVCLR register
//
//*****************************************************************************
#define MEMCFG_NMAVCLR_CPUREAD    0x1U         // Non Master CPU Read Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUWRITE   0x2U         // Non Master CPU Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUFETCH   0x4U         // Non Master CPU Fetch Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_DMAWRITE   0x8U         // Non Master DMA Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1READ   0x10U        // Non Master CLA1 Read Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the NMAVINTEN register
//
//*****************************************************************************
#define MEMCFG_NMAVINTEN_CPUREAD  0x1U         // Non Master CPU Read Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUWRITE  0x2U         // Non Master CPU Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CPUFETCH  0x4U         // Non Master CPU Fetch Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_DMAWRITE  0x8U         // Non Master DMA Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1READ  0x10U        // Non Master CLA1 Read Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1WRITE  0x20U        // Non Master CLA1 Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_NMAVINTEN_CLA1FETCH  0x40U        // Non Master CLA1 Fetch Access
                                               // Violation Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVFLG register
//
//*****************************************************************************
#define MEMCFG_MAVFLG_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag
#define MEMCFG_MAVFLG_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag
#define MEMCFG_MAVFLG_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVSET register
//
//*****************************************************************************
#define MEMCFG_MAVSET_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag Set
#define MEMCFG_MAVSET_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag Set
#define MEMCFG_MAVSET_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVCLR register
//
//*****************************************************************************
#define MEMCFG_MAVCLR_CPUFETCH    0x1U         // Master CPU Fetch Access
                                               // Violation Flag Clear
#define MEMCFG_MAVCLR_CPUWRITE    0x2U         // Master CPU Write Access
                                               // Violation Flag Clear
#define MEMCFG_MAVCLR_DMAWRITE    0x4U         // Master DMA Write Access
                                               // Violation Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the MAVINTEN register
//
//*****************************************************************************
#define MEMCFG_MAVINTEN_CPUFETCH  0x1U         // Master CPU Fetch Access
                                               // Violation Interrupt Enable
#define MEMCFG_MAVINTEN_CPUWRITE  0x2U         // Master CPU Write Access
                                               // Violation Interrupt Enable
#define MEMCFG_MAVINTEN_DMAWRITE  0x4U         // Master DMA Write Access
                                               // Violation Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRFLG register
//
//*****************************************************************************
#define MEMCFG_UCERRFLG_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag
#define MEMCFG_UCERRFLG_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag
#define MEMCFG_UCERRFLG_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRSET register
//
//*****************************************************************************
#define MEMCFG_UCERRSET_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag Set
#define MEMCFG_UCERRSET_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag Set
#define MEMCFG_UCERRSET_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the UCERRCLR register
//
//*****************************************************************************
#define MEMCFG_UCERRCLR_CPURDERR  0x1U         // CPU Uncorrectable Read Error
                                               // Flag Clear
#define MEMCFG_UCERRCLR_DMARDERR  0x2U         // DMA Uncorrectable Read Error
                                               // Flag Clear
#define MEMCFG_UCERRCLR_CLA1RDERR  0x4U         // CLA1 Uncorrectable Read Error
                                               // Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRFLG register
//
//*****************************************************************************
#define MEMCFG_CERRFLG_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag
#define MEMCFG_CERRFLG_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag
#define MEMCFG_CERRFLG_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRSET register
//
//*****************************************************************************
#define MEMCFG_CERRSET_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag Set
#define MEMCFG_CERRSET_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag Set
#define MEMCFG_CERRSET_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag Set

//*****************************************************************************
//
// The following are defines for the bit fields in the CERRCLR register
//
//*****************************************************************************
#define MEMCFG_CERRCLR_CPURDERR   0x1U         // CPU Correctable Read Error
                                               // Flag Clear
#define MEMCFG_CERRCLR_DMARDERR   0x2U         // DMA Correctable Read Error
                                               // Flag Clear
#define MEMCFG_CERRCLR_CLA1RDERR  0x4U         // CLA1 Correctable Read Error
                                               // Flag Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTFLG register
//
//*****************************************************************************
#define MEMCFG_CEINTFLG_CEINTFLAG  0x1U         // Total corrected error count
                                               // exceeded threshold flag.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTCLR register
//
//*****************************************************************************
#define MEMCFG_CEINTCLR_CEINTCLR  0x1U         // CPU Corrected Error Threshold
                                               // Exceeded Error Clear.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTSET register
//
//*****************************************************************************
#define MEMCFG_CEINTSET_CEINTSET  0x1U         // Total corrected error count
                                               // exceeded flag set.

//*****************************************************************************
//
// The following are defines for the bit fields in the CEINTEN register
//
//*****************************************************************************
#define MEMCFG_CEINTEN_CEINTEN    0x1U         // CPU/DMA Correctable Error
                                               // Interrupt Enable.

//*****************************************************************************
//
// The following are defines for the bit fields in the ROMWAITSTATE register
//
//*****************************************************************************
#define MEMCFG_ROMWAITSTATE_WSDISABLE  0x1U         // ROM Wait State Enable/Disable
                                               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the ROMPREFETCH register
//
//*****************************************************************************
#define MEMCFG_ROMPREFETCH_PFENABLE  0x1U         // ROM Prefetch Enable/Disable
                                               // Control
#endif
